[
    {
        "title":"Raspberry Pi คืออะไร?",
        "subtitle":"Raspberry Pi คือ คอมพิวเตอร์จิ๋ว",
        "image_url":"https://cdn.pixabay.com/photo/2017/04/04/18/12/video-game-console-2202618_960_720.jpg",
        "detail":"Raspberry Pi (ออกเสียงว่า ราส-เบอร์-รี่-พาย) เป็นเครื่องคอมพิวเตอร์ขนาดจิ๋ว ที่มีขนาดเพียงเท่ากับบัตรเครดิต ที่สำคัญคือ ราสเบอร์รี่พายนี้มีราคาที่ถูกมาก เมื่อเทียบกับคอมพิวเตอร์เดสก์ท็อปปกติ คือมีราคาเพียงแค่หนึ่งพันกว่าบาทเท่านั้นเอง!!! แต่เห็นราคาเท่านี้ ทำงานได้เหมือนเครื่องคอมพิวเตอร์ทุกอย่างเลยนะครับ เราสามารถต่อ ราสเบอร์รี่พายนี้เข้ากับจอคอมพิวเตอร์หรือจอทีวีที่รองรับ HDMI หรือถ้าไม่มีพอร์ต HDMI ก็ไม่ต้องกังวล สามารถต่อผ่านสายสัญญาณวิดีโอปกติ (เส้นสีเหลือง) ได้เช่นกัน แต่ความละเอียดอาจจะต่ำกว่า\n\nนอกจากต่อจอแสดงผลแล้ว ก็ต้องต่ออุปกรณ์รับข้อมูล ราสเบอร์รี่พายนี้รองรับเมาส์และคีย์บอร์ดผ่าน USB port ปกติ เพราะฉะนั้นสามารถนำเมาส์และคีย์บอร์ดที่มีอยู่แล้วมาต่อได้เลย ระบบจ่ายไฟของราสเบอร์รี่พายก็ง่ายมากๆ เพียงเสียบสาย Mini USB ที่เราใช้ชาร์จมือถือและอุปกรณ์อื่นๆ เข้ากับคอมพิวเตอร์ หรือเข้ากับหัวชาร์จไฟมือถือก็ได้เช่นกัน\n\nราสเบอร์รี่พาย (Raspberry Pi) เกิดขึ้นในปี 2549 ที่มหาวิทยาลัยเคมบริดจ์ ประเทศอังกฤษ โดยผู้สร้างทั้งสี่คนคือ อีเบน อัพตั้น, ร๊อบ มูลลิ่นส์, แจ๊ค แลง และ อลัน มายครอฟท์ มีจุดมุ่งหมายที่จะให้ ราสเบอร์รี่พายเป็นคอมพิวเตอร์ราคาย่อมเยาที่ใครๆ ก็สามารถหามาครอบครองได้ และสามารถศึกษาการทำงานของคอมพิวเตอร์พร้อมทั้งเขียนโปรแกรมง่ายๆ ได้ทันที การที่ราสเบอร์รี่พายเป็นบอร์ดวงจรรวมที่เปลือยเปล่า ทำให้เด็ก ๆ ได้เห็นชิ้นส่วนทั้งหมดที่เป็นส่วนประกอบของคอมพิวเตอร์ได้อย่างชัดเจน ซึ่งจะทำให้เข้าใจการทำงานของคอมพิวเตอร์ในปัจจุบันที่มาในกล่องสวยงามได้มากขึ้น"
    },
    
    {
        "title":"Python คือ",
        "subtitle":"ภาษาการเขียนโปรแกรมระดับสูง",
        "image_url":"https://cdn.pixabay.com/photo/2015/12/04/14/05/code-1076536_960_720.jpg",
        "detail":"โลกในยุคดิจิทัล (Digital age) ได้มีความก้าวหน้าในการพัฒนาเทคโนโลยีอย่างรวดเร็วแบบก้าวกระโดด ทำให้มีบทบาทสำคัญในการพัฒนาขับเคลื่อนธุรกิจ และอำนวยความสะดวกในชีวิตประจำวัน เช่น การทำธุรกรรมทางการเงินกับธนาคารแบบออนไลน์ การใช้ระบบสั่งการคอมพิวเตอร์ด้วยเสียง การตรวจสุขภาพเบื้องต้นด้วยแอปพลิเคชันบนมือถือ และระบบ Google Search ที่สามารถรู้ว่าคุณกำลังค้นหาข้อมูลอะไรก่อนที่เราจะพิมพ์จบประโยค เป็นต้น นอกจากนั้นยังมีนวัตกรรมเทคโนโลยีที่มีความล้ำหน้าต่าง ๆ โดยเฉพาะงานทางด้านปัญญาประดิษฐ์ (Artificial Intelligence) เช่น บริษัท DeepMind ได้พัฒนาระบบคอมพิวเตอร์ Alpha Go ที่สามารถแข่งขันเอาชนะเกมหมากล้อมเหนือแชมป์โลกได้ และยังมีระบบคอมพิวเตอร์ล่าสุดที่ชื่อว่า AlphaStar  ที่สามารถเอาชนะทีมมนุษย์ในเกม StarCraft II ได้ รวมถึงรถยนต์ไร้คนขับที่สามารถเดินทางบนถนนได้จริง และหุ่นยนต์คอมพิวเตอร์ที่จะสามารถทำงานทดแทนมนุษย์ได้ในอนาคต\n\nแม้ว่าคอมพิวเตอร์จะสามารถทำงานได้หลายอย่างและมีประสิทธิภาพที่สูงมาก อย่างไรก็ตามมันไม่ได้มีความสามารถหรือความฉลาดได้ด้วยตัวของมันเองแต่อย่างใด แต่สิ่งที่ทำให้คอมพิวเตอร์สามารถทำงานต่าง ๆ ได้ก็คือสิ่งที่เรียกว่า “โปรแกรม” ที่คอยทำงานอยู่เบื้องหลัง ซึ่งเป็นชุดคำสั่งที่มีการกำหนดขั้นตอนที่ชัดเจนเพื่อสั่งงานให้คอมพิวเตอร์ทำงานตามที่เราต้องการ ไม่ว่าจะเป็นการจัดการกับข้อมูลที่นำเข้ามาในระบบ การตัดสินใจสำหรับเงื่อนไขต่าง ๆ การประมวลผลข้อมูล การสื่อสารกับระบบภายในและภายนอก การจัดการความผิดพลาดที่เกิดขึ้น และการแสดงผลในรูปแบบต่าง ๆ เป็นต้น แม้ว่าในงานทางด้านปัญญาประดิษฐ์ ระบบคอมพิวเตอร์จะสามารถตัดสินใจเองจนสามารถแข่งขันเกมเอาชนะเหนือมนุษย์ได้ แต่ยังมีความจำเป็นที่จะต้องเขียนโปรแกรมในการสร้างโมเดลเพื่อสอนให้คอมพิวเตอร์สามารถเรียนรู้จากข้อมูลเองได้ ดังนั้นหากเราต้องการให้คอมพิวเตอร์ทำงานใดก็ตาม จะต้องอาศัยการเขียนโปรแกรมเพื่อสั่งงานคอมพิวเตอร์ให้ทำงานตอบสนองความต้องการของเราได้"
    }
]

            
